Конфигурация/Documents/ВыводКредитногоИнструмента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ВыводКредитногоИнструмента</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РезервыПредстоящихРасходов</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.ВводыВыводыАктивовВВалютеУчета</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваВКредитныхИнструментах</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КредитныйИнструмент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КредитныеИнструменты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПроцентов</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ДенежныеСредстваВКредитныхИнструментах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредстваВКредитныхИнструментах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипКредитногоИнструмента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКредитныхИнструментов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидКредитногоИнструмента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКредитныхИнструментов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КредитныйИнструмент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КредитныеИнструменты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/Documents/ВыводКредитногоИнструмента/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция ПолучитьОборотПоДепозитномуВкладу(ДанныеОбъекта)
	
	Если Не ЗначениеЗаполнено(ДанныеОбъекта.Ссылка)
		Или Не ЗначениеЗаполнено(ДанныеОбъекта.КредитныйИнструмент)
		Или Не ЗначениеЗаполнено(ДанныеОбъекта.Организация)
		Или Не ЗначениеЗаполнено(ДанныеОбъекта.СчетДоверительногоУправления)
	Тогда
		Возврат 0;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ДенежныеСредстваВКредитныхИнструментах.Сумма) КАК Сумма
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваВКредитныхИнструментах КАК ДенежныеСредстваВКредитныхИнструментах
		|ГДЕ
		|	ДенежныеСредстваВКредитныхИнструментах.Регистратор = &Регистратор
		|	И ДенежныеСредстваВКредитныхИнструментах.КредитныйИнструмент = &КредитныйИнструмент
		|	И ДенежныеСредстваВКредитныхИнструментах.Организация = &Организация
		|	И ДенежныеСредстваВКредитныхИнструментах.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|
		|СГРУППИРОВАТЬ ПО
		|	ДенежныеСредстваВКредитныхИнструментах.Регистратор,
		|	ДенежныеСредстваВКредитныхИнструментах.КредитныйИнструмент,
		|	ДенежныеСредстваВКредитныхИнструментах.Организация,
		|	ДенежныеСредстваВКредитныхИнструментах.СчетДоверительногоУправления";
		
	Запрос.УстановитьПараметр("Регистратор",                  ДанныеОбъекта.Ссылка);
	Запрос.УстановитьПараметр("КредитныйИнструмент",          ДанныеОбъекта.КредитныйИнструмент);
	Запрос.УстановитьПараметр("Организация",                  ДанныеОбъекта.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ДанныеОбъекта.СчетДоверительногоУправления);
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Сумма;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции // ПолучитьОборотПоДепозитномуВкладу

#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	РаботаСЖурналамиОперацийКлиентСервер.ОповеститьЖурналыОбИзменении();
	
	ЭтаФорма.СуммаВклада = ПолучитьОборотПоДепозитномуВкладу(
		ОбщегоНазначенияКлиентСервер.ПоляВСтруктуру(Объект, "Ссылка, КредитныйИнструмент, Организация, СчетДоверительногоУправления"));
	
	РаботаСДокументамиКлиент.ПроверитьПараметрыПодтвержденияОперации(ЭтаФорма, Объект, ПараметрыЗаписи);

КонецПроцедуры

#КонецОбласти

#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ЭЛЕМЕНТОВ_ШАПКИ_ФОРМЫ

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(Объект.Дата, Объект.Ссылка);
	
	ЭтаФорма.СуммаВклада = ПолучитьОборотПоДепозитномуВкладу(
		ОбщегоНазначенияКлиентСервер.ПоляВСтруктуру(Объект, "Ссылка, КредитныйИнструмент, Организация, СчетДоверительногоУправления"));

КонецПроцедуры

&НаКлиенте
Процедура ДепозитныйВкладПриИзменении(Элемент)
	
	ЭтаФорма.СуммаВклада = ПолучитьОборотПоДепозитномуВкладу(
		ОбщегоНазначенияКлиентСервер.ПоляВСтруктуру(Объект, "Ссылка, КредитныйИнструмент, Организация, СчетДоверительногоУправления"));
	
КонецПроцедуры

#КонецОбласти

#Область СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
			
	ЭтаФорма.УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Организация", Объект.Организация));

	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СчетДоверительногоУправления, "ВидДоговораДоверительногоУправления") <> ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.Собственный") Тогда
	
		ЭтаФорма.ТипПередачи = РаботаСДокументами.ПолучитьТипПередачиДляВводаВыводаАктивов(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления, Объект.Контрагент);
		
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
	ЭтаФорма.СуммаВклада = ПолучитьОборотПоДепозитномуВкладу(
		ОбщегоНазначенияКлиентСервер.ПоляВСтруктуру(Объект, "Ссылка, КредитныйИнструмент, Организация, СчетДоверительногоУправления"));
			
КонецПроцедуры //ПриЧтенииСозданииНаСервере()
	
&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(Форма)
	
	ДанныеОбъекта = Форма.Объект;
	Элементы	  = Форма.Элементы;
	
	СобственныйСчетДУ = (ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеОбъекта.СчетДоверительногоУправления, "ВидДоговораДоверительногоУправления") = ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.Собственный"));

	Элементы.ТипПередачи.Видимость = Не СобственныйСчетДУ;
	Элементы.Контрагент.АвтоОтметкаНезаполненного = РаботаСДокументамиКлиентСервер.ТребуетсяПроверкаЗаполненияЗначенияКонтрагента(ДанныеОбъекта);
	Элементы.Контрагент.ТолькоПросмотр = Форма.ТипПередачи < 2 И Не СобственныйСчетДУ;
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиПоБухгалтерскомуУчету()

	РаботаСФормамиКлиент.ПровестиПоБухгалтерскомуУчету(ЭтаФорма); 

КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.СчетДоверительногоУправленияОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.ДатаОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СчетДоверительногоУправления, "ВидДоговораДоверительногоУправления") = ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.Собственный") Тогда
		ЭтаФорма.ТипПередачи = 0;
	КонецЕсли;
	
	Объект.Контрагент = РаботаСДокументамиКлиент.ПолучитьКонтрагентаДляВводаВыводаАктивов(Объект.Дата, ЭтаФорма.ТипПередачи, Объект.Организация, Объект.СчетДоверительногоУправления);
	
	НастроитьВидимостьИДоступность(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ТипПередачиПриИзменении(Элемент)
	
	Объект.Контрагент = РаботаСДокументамиКлиент.ПолучитьКонтрагентаДляВводаВыводаАктивов(Объект.Дата, ЭтаФорма.ТипПередачи, Объект.Организация, Объект.СчетДоверительногоУправления);
	НастроитьВидимостьИДоступность(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОткрытьПрисоединенныеФайлы()

	РаботаСФайловымХранилищемКлиент.ОткрытьПрисоединенныеФайлы(Объект.Ссылка);

КонецПроцедуры

#КонецОбласти
